name_1 = input ("Введіть ваше ім'я:")
name_2 = input ("введіть ім'я друга:")
name_3 = input ("Введіть ім'я друга друга:")
action = input ("введіть будь яку дію:")
reason = input ("введіть причину:")
pet = input ("введіть тваринку:")
hobbi = input("введіть ваше хоббі:")
print(f"Зрада століття! {name_1} і {name_2} були друзями, але одного дня все змінилося.", 
      f"Виявилося, що {name_2} таємно {action} з {name_3}.",
      f"Це було несподівано, боляче і навіть смішно, бо виправданням стало {reason}.",
      f"З того моменту довіра зникла. Тепер {name_1} знає: справжній друг — це тільки {pet} і {hobbi}"
    )